/*
프로젝트 계획

작업을 여러부분으로 나누어 팀원들에게 할당
가능하나 문제 예측 해결책 준비
프로젝트 시작시 작업 수행 방법을 팀원 및 고객에게 전달하고 진행상황 평가에 사용

프로젝트 기획 단계
주기적으로 진행상황을 모니터링 하며 얻은 정보로 계획수정

제안단계 시작단계 개발단계

프로젝트 계획단계 - 제안단계 시작단계 개발단계 이렇게 3가지

제안단계 시스템 제공하기 위한 계약 체결
프로젝트 시작단계 - 누가 참여할지 프로젝트 나눌지 자원 할당할지
자원할당 및 프로젝트 참여

개발단계
프로젝트 진행에 따라 개발에 대한 이해가 깊어진다. 계획정기적으로 수정
프로젝트 일정 비용추정 재검토

프로젝트 계획 시작 개발 단계

제안 = 시스템 제공을 위해 계약체결
시스템 비용 고려
프로젝트 시작 단계
누가 참여할지 프로젝트 어떻게 나눌지 자원 할당에 대해 나눔
구현에 대한 정보가 없음
자원배분
애잘일 메커니즘 모니터링 시작단계 제안 시작 개발 단계
시작 단계에서 예산 인력 배치에 내릴정도로 세부적인 계획을 수립하는건
시작단계

개발 단계
프로젝트가 진행됨에 따라 개발 이해가 기피어진다.

정기적으로 수정되어야함!!


개발단계

소프트웨어 가격
소프트웨어 생산 비용을 파악하기 위해 추정 필요
개발 비용과 고객 청구비용은 단순 관계가 아니다
조직적 경제적 비즈니스적 정치적 고려 사항이 가격 책정에 영향을 미친다.

계약조건 개발자가 코드 소유권을 갖고 다른 프잭 재활용하면 가격인하
비용 추정 불확실성 비용 추정이 불확실하면 가격인상
재정건정성 재정에 어려움이 있을경우 계약에서 가격 인하 현금흐름보다 이윤이중요
시장기회 시장에서 새로운 진출을 위해 낮은 가격제시 큰 이익을 얻을수 있는 기회
요구 사항 변동성 계약 성사를 위해 가격인하가능 체결이후 변경되면 높은가격
기회를 얻기 위해 낮은 가격 책정
구매자가 고정 가격 계약을 원할떄 리스크를 감안하여 가격인상.
구매자의사에 따라 가격 책정 및 축소


플랜드리븐 디벨롭

소프트웨어 공학에서 개발 프로세스가 세부적으로 계획 되는 접근 방식
프로젝트 계획은 수행할 작업 사람 개발 일정 및 작업 결과물을 기록하는 문서작성
결국 프로젝트 계획은 문서화넹
관리자들은 이런 계획을 할용해 프로젝트 의사결정과 진행상황 측정
세부적인 계획수립
프로젝트 계획은 사람 일정 및 개발결과물을 문서화
이러한 계획을 활용해 의사결정과 진행상황 측정
장저 - 초기계획을 통해 조직적 이슈를 철저히 고려
잠재적인 문제와 의존성을 개발 시작전에 발견할수 있음
단점 - 개발 환경 변화로 인해 많은 초기 결정을 수정해야함
장점 초기계획을 통해 이슈를 철저히 관리 하고 잠재적인 문제와 의존성을 개발 전에 알 수 있다.
단점은 개발환경 변경에 따라 초기 계획을 수정해야한다.

프로젝트 플렌
이용가능한 작업 내역 및 작업 수행일정을 설정
프로젝트 시작단계에서 초기 프로젝트 계획을 만들때 시작되는 반복 프로세스
추가정보에 따른 변경사항을 반영함으로써 계획 변경은 불가피하다.

프로젝트 계획 부가항목
형상관리 계획 배치계획 유지보수 계획 품질 계획 검증 계획
검증계획 유지보수 계획 배치계획 형상관리 계획 품질계획
형상관리 배치계획 유지보수 검증 품질

낙관적인 가정 보다 현실적인 가정 설립 - 계획 가정
개발 작업에 심각한 지연을 발생하는 문제가 있을경우 완화 조치 시작

요구사항 검증 고객이 실제로 원하는 시스템을 검정하는것
요구사항 오류가 높아서 실제로 검증이 필요하다
요구사항 도출 분석 검증 문서화
요구사항 도출 분석 검증 문서화
도출 분석 검증 문서화
도출과 분석단계에서
발견 - 분류 및 구성 우선순위 부여 및 협상 그리고 명세화
발견 분류 및 구성
도출 분석 검증 문서화
도출 분석 단계  발견 분류 및 구성 우선순위 부여 및 협상 그리고 문서화


요구사항 검증 확인요소
유효성 일관성 완전성 실현성 검증 가능성
유효성 일관성 완전성 실형성 검증 가능성

요구사항 검증 기법
1. 요구사항 검토 2. 프로토타이핑 3. 테스트 케이스 생성
1. 요구사항 검토 2. 프로토 타이핑 3. 테스트케이스 생성

이렇게 요구사항 검증 방법

요구사항 검토
요구사항의 정의를 공식화 하는동안 검토 고객 및 직원 모두 참여
공식 및 비공식 인터뷰

요구사항 검증에서는
유효성 일관성 완전성 실현성 검증 가능성
요구사항 검증기법
요구사항 검토 프로토타이핑 테스트케이스 생성

요구사항 검토를 할때는 모든 직원 사용자 참여

요구사항 변경

시스템 비즈니스및 기술은 항상 변경되어진다.

시스템 비용을 지불하는 사람과 시스템 사용자가 동일하진않는다.
최종시스템 요구사항은 우선순위 절충안 경험을 통해 균형을 변경해야하는경우 발생

시스템 개발중 변화하는 요구사항 관리하는과정
시스템 개발 및 사용후 새로운 요구사항
요구사항 변경의 영향을 평가하기 위해
프로젝트 스케줄링시 작업 종속성을 최소화해야한다.

도구 지원
변경지원 면경명세
변경 분석 및 비용산출
변경구현

요구사항 식별 변경관리 프로세스
추적 가능성정책
도구지원
분선문제 및 변경명세
변경분석 및 비용산출
변경 구현


시스템 모델링

cim pim psm 은 mda mde mda모델 기반 아키텍쳐이다.
cim 계산 기반 독립 모델 시스템에 사용되는 주요한 도메인을 추상화모델링
pim 플렛퐁 독립 모델 구현참조하지 않는다.
psm 플랫폼 특정 모델 플랫폼에 대해 별도의 사용으로 플랫폼 독립모델변형






*/