/*
프로젝트 계획

작업을 여러부분으로 나누어 팀원들에게 할당
가능하나 문제 예측 해결책 준비
프로젝트 시작시 작업 수행 방법을 팀원 및 고객에게 전달하고 진행상황 평가에 사용

프로젝트 기획 단계
주기적으로 진행상황을 모니터링 하며 얻은 정보로 계획수정

제안단계 시작단계 개발단계

프로젝트 계획단계 - 제안단계 시작단계 개발단계 이렇게 3가지

제안단계 시스템 제공하기 위한 계약 체결
프로젝트 시작단계 - 누가 참여할지 프로젝트 나눌지 자원 할당할지
자원할당 및 프로젝트 참여

개발단계
프로젝트 진행에 따라 개발에 대한 이해가 깊어진다. 계획정기적으로 수정
프로젝트 일정 비용추정 재검토

프로젝트 계획 시작 개발 단계

제안 = 시스템 제공을 위해 계약체결
시스템 비용 고려
프로젝트 시작 단계
누가 참여할지 프로젝트 어떻게 나눌지 자원 할당에 대해 나눔
구현에 대한 정보가 없음
자원배분
애잘일 메커니즘 모니터링 시작단계 제안 시작 개발 단계
시작 단계에서 예산 인력 배치에 내릴정도로 세부적인 계획을 수립하는건
시작단계

개발 단계
프로젝트가 진행됨에 따라 개발 이해가 기피어진다.

정기적으로 수정되어야함!!


개발단계

소프트웨어 가격
소프트웨어 생산 비용을 파악하기 위해 추정 필요
개발 비용과 고객 청구비용은 단순 관계가 아니다
조직적 경제적 비즈니스적 정치적 고려 사항이 가격 책정에 영향을 미친다.

계약조건 개발자가 코드 소유권을 갖고 다른 프잭 재활용하면 가격인하
비용 추정 불확실성 비용 추정이 불확실하면 가격인상
재정건정성 재정에 어려움이 있을경우 계약에서 가격 인하 현금흐름보다 이윤이중요
시장기회 시장에서 새로운 진출을 위해 낮은 가격제시 큰 이익을 얻을수 있는 기회
요구 사항 변동성 계약 성사를 위해 가격인하가능 체결이후 변경되면 높은가격
기회를 얻기 위해 낮은 가격 책정
구매자가 고정 가격 계약을 원할떄 리스크를 감안하여 가격인상.
구매자의사에 따라 가격 책정 및 축소


플랜드리븐 디벨롭

소프트웨어 공학에서 개발 프로세스가 세부적으로 계획 되는 접근 방식
프로젝트 계획은 수행할 작업 사람 개발 일정 및 작업 결과물을 기록하는 문서작성
결국 프로젝트 계획은 문서화넹
관리자들은 이런 계획을 할용해 프로젝트 의사결정과 진행상황 측정
세부적인 계획수립
프로젝트 계획은 사람 일정 및 개발결과물을 문서화
이러한 계획을 활용해 의사결정과 진행상황 측정
장저 - 초기계획을 통해 조직적 이슈를 철저히 고려
잠재적인 문제와 의존성을 개발 시작전에 발견할수 있음
단점 - 개발 환경 변화로 인해 많은 초기 결정을 수정해야함
장점 초기계획을 통해 이슈를 철저히 관리 하고 잠재적인 문제와 의존성을 개발 전에 알 수 있다.
단점은 개발환경 변경에 따라 초기 계획을 수정해야한다.

프로젝트 플렌
이용가능한 작업 내역 및 작업 수행일정을 설정
프로젝트 시작단계에서 초기 프로젝트 계획을 만들때 시작되는 반복 프로세스
추가정보에 따른 변경사항을 반영함으로써 계획 변경은 불가피하다.

프로젝트 계획 부가항목
형상관리 계획 배치계획 유지보수 계획 품질 계획 검증 계획
검증계획 유지보수 계획 배치계획 형상관리 계획 품질계획
형상관리 배치계획 유지보수 검증 품질

낙관적인 가정 보다 현실적인 가정 설립 - 계획 가정
개발 작업에 심각한 지연을 발생하는 문제가 있을경우 완화 조치 시작

요구사항 검증 고객이 실제로 원하는 시스템을 검정하는것
요구사항 오류가 높아서 실제로 검증이 필요하다
요구사항 도출 분석 검증 문서화
요구사항 도출 분석 검증 문서화
도출 분석 검증 문서화
도출과 분석단계에서
발견 - 분류 및 구성 우선순위 부여 및 협상 그리고 명세화
발견 분류 및 구성
도출 분석 검증 문서화
도출 분석 단계  발견 분류 및 구성 우선순위 부여 및 협상 그리고 문서화


요구사항 검증 확인요소
유효성 일관성 완전성 실현성 검증 가능성
유효성 일관성 완전성 실형성 검증 가능성

요구사항 검증 기법
1. 요구사항 검토 2. 프로토타이핑 3. 테스트 케이스 생성
1. 요구사항 검토 2. 프로토 타이핑 3. 테스트케이스 생성

이렇게 요구사항 검증 방법

요구사항 검토
요구사항의 정의를 공식화 하는동안 검토 고객 및 직원 모두 참여
공식 및 비공식 인터뷰

요구사항 검증에서는
유효성 일관성 완전성 실현성 검증 가능성
요구사항 검증기법
요구사항 검토 프로토타이핑 테스트케이스 생성

요구사항 검토를 할때는 모든 직원 사용자 참여

요구사항 변경

시스템 비즈니스및 기술은 항상 변경되어진다.

시스템 비용을 지불하는 사람과 시스템 사용자가 동일하진않는다.
최종시스템 요구사항은 우선순위 절충안 경험을 통해 균형을 변경해야하는경우 발생

시스템 개발중 변화하는 요구사항 관리하는과정
시스템 개발 및 사용후 새로운 요구사항
요구사항 변경의 영향을 평가하기 위해
프로젝트 스케줄링시 작업 종속성을 최소화해야한다.

도구 지원
변경지원 면경명세
변경 분석 및 비용산출
변경구현

요구사항 식별 변경관리 프로세스
추적 가능성정책
도구지원
분선문제 및 변경명세
변경분석 및 비용산출
변경 구현


시스템 모델링

cim pim psm 은 mda mde mda모델 기반 아키텍쳐이다.
cim 계산 기반 독립 모델 시스템에 사용되는 주요한 도메인을 추상화모델링
pim 플렛퐁 독립 모델 구현참조하지 않는다.
psm 플랫폼 특정 모델 플랫폼에 대해 별도의 사용으로 플랫폼 독립모델변형


프로젝트 계획

프로젝트 기획

프로젝트 제안 프로젝트 시작 프로젝트 개발 단계
제안 시작 개발 단계

software pricing
소프트웨어 비용을 파악하기 위해 필요

정치적 상황 조직적 경제적 고려사항이 가격에 영향을 미친다.


소프트웨어 가격에 영향을 미치는 요수
계약조건 비용추정의 불확실성 재정 건정성 시장기회 요구사항 변동성
계약조건 비용추정의 불확실성 재정 건정서 시장기회 요구사항 변동성

가격 전략 언더 프라이싱 인크리스 프라이싱

언더 프라이싱 미래의 기회를 위해 낮은 가격 책정
구매자가 고정 가격 제안을 할 시 리스크를 감안해 가격을 인상



플랜드리븐 개발
개발 프로세스에서 세부적으로 계획을 세우고 접근
프로젝트 계획은 수행할 작업 사람 개발 및 대규모 문서를 작성해야함

장점 : 초기 계획을 통해 조직적으로 이슈 관리가능 잠재적인 문제와 의존성을 프로젝트시작이전에 알수 있다.
단점 소프트웨어 개발 환경 변화로 인해 초기 계획에서 많이 수정해야함

프로젝트 부가 항목
형상관리 계획 형상을 관리 및 절차 구조설명
배치 계획 어떻게 하드 소프트웨어를 배치할것인가
유지보수 계획 품질계획 검증계획 계획 검증계획 유지보수 계획 형상관리 계획 검증 계획

계획 가정 낙관전 보다 보수적으로 가정 설립

위험 완화 개발 작업에 심각한 지연을 발생하는 문제가 있을때 위험을 줄이기 위해 조치 시작


프로젝트 스케줄링

프로젝트 결정을 내리는 과정 각작업에대한 시간 및 인력 추정
리소스 추정

프로젝트를 각작업으로 나누고 시간 자원 추정
인력을 최적적으로 활용하기 위해서 작업을 동시에 구성한다.
종속성 최소화로 작업지연 방지
인력 최적화 동시 작업 종속성 최소화로 인한 작업지연 방지

일정문제
문제의 난이도와 그에 따른 솔루션 개발 비용 추정 어려움
예기치 못한 일에 대해 계획 해야한다.

일정 표현 일반적으로 그래픽 막대 등 이런걸로 스케줄링 표현한다.

프로젝트 활동
프로젝트 활동은 기본적인 계획 요소
소요기간 노력추정 마감일 명확한 종료시점과 같은 작업 스케줄링 필요

이정표와 산출물 이정표 현재 진행상황을 평가할 수 있는 포인트
샅출물 고겍에게 전달되어지는 작업 산출물
이정표 산출물

wbs cpm gantt

wbs 프로젝트를 작은 구성요소로 나누어 결과물 중심으로 불류
cpm  프로젝트 활동 스케줄링을 위한 알고리즘
gantt 프로젝트 일정을 보여주는 막대 그래프 wbs cpm gantt


agile
소프트웨어가 점진적으로 개발되어져서 고객에게 제공되어지는 반복적인 점근방식
plan-driven과 다르게 증분기능이 미리 계획되어있지 않다.
유연한 계획 필요

애자일에서의 계획수립
릴리즈 계획수립 반복 계획 수립이있따.
릴리즈에 포함해야하는 기능 확정 릴리즈 계획수립
시스템 다음 증분을 중점두는 행위 이터레이티브 계획수립

애자일 플래닝
1 . 스크럼 플래닝 프로젝트 백로그 기반 현재상황 문제점을 매일 검도
2. 플레닝 게임 사용자 스토리 기반으로 진행상황 측정

애자일 릴리즈 계획 수립 이터레이티브 계획수립을 하고

애자일의 플레닝에는 스크럼 플래닝 백로그 플레잉 게임 xp의 일환 스토리 기반으로 진행상황 측정하는것

스토리 베이스 플래닝
사용자 스토리 기반으로 포함되어야할 기능 반영
하루에 effect point의 개수를 기반으로 스토리 플래닝의 숫자 측정 가능
이를 통해 시스템 구현에 필요한 총 노력 추정 가능


애자일 플레닝 스크럼 그리고 플레이 게임
스토리 베이스 플레닝

 task allocation  개발자는 개발작업을 세분화했다.
 개발작업은 4~16시간 소요 해당 반복에서 구현해야 할 모든 작업을 나열
 특정 작업에 등록
 동기부여를 얻을 수 있다.

 스토리 파악 첮번째 측정 릴리즈 계획수립 이터레이티브 계획수립 테스크 계획



측정 기술
조직은 소프트웨어의 노력 및 비용 추정을 해야한다.
1. 경험을 기반으로 한 비용추정 2. 알고리즘 기반 비용추정이 있다.

경험을 기반으로 한 비용추정에는 과거 프로젝트 경험에 기반하여 판다. 시트에 문서화 후 개별적 추정으로 노력 계산
그룹 구성원에게 각자 추정을 설명

문제점 만약에 기술개발을 하면 경험이 노력추정에 도움이 되어지지 않는다.
새프로젝트가 이전과 비슷하지 않을 수 있따.

알고리즘 비용추정
effect = a * size b * m
A 조직에 고유 작업량
B 대규모 프로젝트에 대한 불균형적인 노력
M 제품 프로세스 사람 속성에 반영하는 승수 복잡한 제품일수록 승수가 커지고 많은 시간이 들어간다.
SIZE 비용추정에 기본적으로 사용되는 코드 크기


ESTEMATION accuraacy
소프트웨어의 크기 가 커질 때 정확히 알 수 있다.
재사용된 시스템 및 요소 사용 시스템의 분포가 큰 영향을 준다.
개발 프로세스가 진행됨에따라 이스티메이트 어큐런시의 정확도 증가

코코모모델 프로젝트 경험을 바탕으로 한 경험적 모델
특정 소프트웨어에 종속 되어지지 않는 문서화 독립무델


코코모 모델의 종류
어플리케이션 컴포지션 모델 기존 부품으로 구성될때
얼리 디자인 모델 요구사항은 정의 되었지만 기본적인 설계는 시작하지 않았을떄

리유즈 모델 재사용 가능한 모델계산
블랙 박스 0 화이트 박스 라인수에따락 계싼

포스트 아키텍처 모델 아키텍처 설계후 시스템에 대한 축가정보 사용 할 수 있을때 사용

requirement engineering
요구 공학

서비스를 정립하는 과정
시스템 요구사항은 시스템 서비스에 대한 요구공학 프로세스 중 생성되는 제약조건 포함

요구사항
시스템 제약에 대한 추상적인 설명

시스템 요구사항 사용자 요구사항으로 나누어지는데
사용자 요구사항은 자연어로 된 설명 및 시스템이 제공하는 서비스에대한다이어그램
시스템 요구 사항은 시

기능적 요구사항 비기능적 요구사항

비기능적 요구사항
시스템이 제공하는 기능에대한 제약을 명시
특정 ide 프로그래밍 언어 개발 방법을 요구하는 요구사항 지정가능


요구사항 도출 요구사항 분석 요구사항 검증 요구사항 명세
요구사항 도출 분석떄
요구사항 발견 요구사항 분류화 요구사항 우선 및 요구사항명세
요구사항 발견 부류및 구성 부여 및 협상 명세화

요구사항 변경

요구사항 관리 요구사항을 관리하는것
시스템 개발 및 사용후 새로운 요구사항

시스템 모델링 컨텍스트 모델링
어떤것이 존재하거나 일어나는 상황

행동 모델

시스템이 실행되는동안 동적행동의 모델

데이터 및 이벤트에 의해 동적모델

데이터드리븐 모델링
이벤트드리븐 모델링
스테이트머신 모델스
외부 자극 및 이벤트에 대한 시스템 모델링

실시간 시스템은 최소한의 데이터 처리를 통해 이벤트 드리븐 운영경우가 많다.
데이터 드리븐 모델링
외부 이벤트 처리가 상대적으로 적은 시스템에 입력되는 데이터에의해 제어


MDE 모델 기반 공학

프로그램 보다는 모델이 개발 주요과정의 출력물인 SW개발을 위한 접근방식
프로그램은 모델에서 자동생서

애자일에서는 configuration management가 필수적
코드에 변경사항 적용하고 시스템 빌딩 도구로 새시스템 생성후 테스트

변경이 완료되면 수정된 컴포넌트 저장소에 반환

cm의 종류

version management 다중 버전 추적 및 개발자 충돌방지
system building  프로그램 컴포넌트 데이터 라이브러리 조립 및 실행 가능시스템으로 컴파일
change management 소프트웨어 변경 요청 추적 비용 및 영향 평가 후 변경여부
release management 소프트웨어 외부 배포 준비 및 시스템 버전 추적

agiel development and cm
애자일 개발은 cm도구 없이는 불가능
컴포넌트 변경사항을 적용하고 시스템 빌딩 도구로 새시스템 생성 후 테스트
변경이 완료되면 수정된 컴포넌트를 프로젝트 저장소에 반환



아키텍져 디자인

아키텍쳐 설계 과정

아키텍쳐 설계 디자인
창의적인 과정 시스템 유형에 따라 아키텍처 디자인 방식이 다를수 있음
기능적 비기능적 특징에 영향을 준다. 아키텍쳐 디자인\

성능 보안 유지보수 배포
성능 요청처리 시간을 줄이기위해 최소화된 컴포넌트 구조 사용
보안 데이터를 보호하기 위해서 계층적 구조사용
유지보수 시스템 변경시 모듈 독립성을 통해 코드 수정용이
유지보수를 하려면 모듈이 독립적인 아키텍쳐를 사용해야겠다.

보안 계층적 성능은 컴포넌트들을 최소화한
배포 시스템 요소를 물리적으로 분리해 효율적으로운영
배포 시스템 요소를 물리적으로 분리하여 효율적으로 운영하는것
배포 보안 유지보수 독립적인 모듈을 가진 아키텍쳐

아키텍쳐 뷰 아키텍쳐를 다양한 관점에서 표현하는 방식
아키텍쳐 뷰는 4가지 로지컬 뷰
피지컬 뷰 프로세스 뷰 디벨롭 뷰
로지컬 뷰 포로세스뷰 피지컬 뷰 디벨롭 뷰

로지컬 뷰 로지컬 뷰 시스템의 기능과 클래스 구조를 표현
로지컬 뷰 - 클래스 다이어그램을 생각하자
프로세스 뷰 런타임에서 시스템 시스템이 어떻게 상호작용 구성되는지
프로세스간 상호작용을 표현 프로세스뷰
디벨롭 뷰는 개발자가 이해하기 쉬운 소프트웨어 모듈 구조 표현
개발자가 이해하기 쉽게 모듈구조를 표현 디벨롭 뷰
다양한 과점에서 제시를

피지컬뷰
시스템이 배포될 하드웨어 네트워크 환경 표현 서버 클라이언트
피지컬뷰

로지컬뷰 클래스 다이어그램
프로세스뷰 프로세스간 상호작용을 나탄낸
피지컬 서버 클라이언트  네트워크나 하드웨어 환경 표현
디벨롭 뷰 개발자가 어떻게 이해하기 쉬운 모듈구조로 개발을 위해 소프트웨어가 어떻게 분해되는지 알수 있는

아키텍쳐 뷰 3가지 포인또
1. 모듈 뷰 모듈간의 관계
2. 컴포넌트 뷰 작업시 요인가 요인간의 상호작용
3. 원크 어사인먼트 뷰 소프트웨어 하드웨어 설치 업무 할당 데이터 저장소
3가지의 포인트 아키텍쳐 뷰
모듈 뷰 컴포넌트 뷰 워크 어사인 먼트 뷰
work assignment view 시스템 hw sw를 어떻게 배치할까?

아키텍쳐 패턴에 대해서 자주 나왔던것 같은데

1.  MVC 패턴 (모델 뷰 컨트롤러)

모델 : 데이터 베이스 비즈니스 로직 시스템 데이터 표현 및 관리 데이터 베이스 모델

컨트롤러 : HTTPS 프로세스 사용자의 입력을 받아서 모델과 뷰를 연결하는 이런 관계
view : 다이내믹 페이지 사용자에게 데이터를 보여주는 화면

mvc 모델 뷰 컨트롤러
아키텍쳐 패턴 1개
모델 에는 데이터 베이스 표현 및 관리하는 시스템
컨트롤러 뷰와 모델사이의 상호작용 해주고 연결
뷰 ui 페이지를 사용자에게 데이터를 보여주는

1. 보안
계층화된 아키텍쳐 패턴 레이어드 아키텍쳐를 사용하면 좋지
계층적 구조를 사용하면 각 계층의 중복이 가능하기 때문에 시스템 신뢰성 향상이되는
장점단점은 레이어간 깔끔하게 분리가 어렵고, 성능적 문제 다양한 계층을 겪으니까?

상위에서 바로 하위가 아닌 저기 아래 하위계층 상호작용 -> 성능적인 저하가 일어나겠져???

독립적으로 설계 유지보수 가능하다.
코드 재사용성이 높아지고 특정 계층만 변경해도 시스템 전체에 미치는 영향 적다.

3. 리포지토리 아키텍
1. mvc 2. 계층적 아키텍쳐
3. 리포지토리 아키텍쳐

하위 시스템은 데이터를 교환한다.
공유데이터 를 사용한다.
각 하위 시스템은 자체 데이터베이스 유지보수 데이터를 다른시스템에 전달
대량의 데이터를 공유할때 레포지토리 모델 공유 사용가능
대량의 데이터 사용 - 리포지토리 아키텍쳐 신뢰성이 높을때
장점 구성요소는 독립적인 기능을 할 수 있다.
한구성요수의 변경사항을 다른 전체의 요수에 전파가 가능하다 데이터가 한곳에 있어서 일관적으로 관리

저장소가 고장나면 전체 시스템에 영향 저장소가 모든 통신구성이 비효율적 여러 컨푸터에 저장소 배포 힘듬


소프트웨어 아키텍쳐 패턴 알아봤음
1. mvc 모델
2. 레이어 아키텍쳐 패턴
3. 서버 클라이언트
4. 리포지토리 아키텍쳐
5. 필터 파이프 패턴


어플리케이션 아키텍쳐 대해 알아봅시다.

특정 조직을 요구를 충족 하독록 설계

공통점 많다. 공통 아키텍쳐를 갖는 경향

데이터 처리 어플리케이션
트랜잭션 프로세싱 어플리케이션
이벤트 프로세싱 시스템
랭기지 프로세싱 시스템

어플리케이션 아키텍쳐
데이터 처리 어플리케이션 data processing app
명시적인 사용자 없이 데이터를 일괄적으로 처리
월말 급여 처리 대량 데이터 분석
트랜젝션 프로세싱 앱 transaction processing app
사용자 요청 처리 시스템 db에서 정보를 업데이트 하는 데이터 중심 앱
사용자 요청 트랜첵션을 따라 db에서 정보 업데이트 하는 데이터 중심 앱

이벤트 프로세싱 시스템 작업이 이벤트에 따라서 수행되어지는 어플리케이션
이벤트를 감지하고 해석후 특정작업 실행
주식 거래 시스템 특정 가격이 조건만족되면 자동으로 주식
이벤트 프로세싱 주식 예약 매수 매도 -> 해당 가격 도달 자동으로 이벤트를 감지하고 실행

언어 처리 시스템
사용자의 자연언어 또는 프로그래밍 언어를 실행하는 시스템
컴파일러


어플리케이션 아키텍쳐
데이터 프로세싱
트랜젝션 프로세싱
이벤트 프로세싱
랭기지 프로세싱 에 따라서
랭귀지 데이터 이벤트 트랜젝션 - > 어플리케이션 아키텍쳐

tps
대량 작업인것 처럼 수행해야하는 그룹
db에 정보에 대해 요청 및 요청을 처리
사용자 입장에서 일관된 작업 그리고 비동기식 작업처리
io 프로세싱 application logic transaction manager database
tps db의 요청에 대해 처리하는것
io 프로세싱 application logic transaction manager db

개발 테스트

테스팅 방법
릴리즈 테스트

개발 테스트 개발중 테스트를 통해 버그 발견
릴리즈 테스트 사용자에게 공개전 별도의 테스트 팀이 전체 버전을 테스트
사용자 테스트 시스템사용자 잠재적 사용자 자신의 환경에서 시스템 테스트

개발테스트 릴리즈 테스트 개발자 테스트 이렇게 테스트 단계가 있습니다.


개발 테스트 릴리즈 테스트 개발자 테스트

개발 테스트

unit 테스팅 component 테스팅 system testing

개별 프로그램 유닛 및 클래스 테스트 - 유닛 테스트
복합 구성요소를 생성하기 위해 유닛이 통합되어질때 테스트
시스템 테스팅 시스템 일부 모든 구성 요소 통합되고 시스템 전체적으로 테스트 구성요소 상호작용 중점

개발 테스팅 릴리즈 테스팅 사용자 테스팅

먼저 개발 테스팅에는 유닛 테스팅 컴포넌트 테스팅 시스템 테스팅 이있다.


유닛 테스팅 개별적으로 테스트 하는 과정

플랜 드리븐 디벨롭

소프트웨어 공학에서 개발 프로세스가 세부적으로 계획이 되어지는 프로세스 방식

계획은 수행할 작업 개발 및 작업 결과물을 기록하는 문서 작성

장점 : 초기계획 통해 조직적으로 이슈를 철저히 관리 잠재적인 문제점들을 계획단계에서 프로젝트 시작전에 발견
단점 : 프로젝트 진행하며 변경사항에 대해서 많이 수정해야한다.

플랜드리븐 플래닝

이용가능한 자원 작업 분할 자원 내역 및 작업 수행을 설정
프로젝트 시작 단계에서 초기 프로젝트를 만들때 시작되는 반복적인 프로세스
추가 정보에 따른 변경사항을 반영함으로써 계획변경은 필수

플랜 섹션

인트로덕션 프로젝트 올가니제이션 리스크 아날리시스 등등

프로젝트 계획 부가적인 항목

형상관리 계획 사용할 형상 관리 절차 및 구조 설명
배치 계획 어떻게 sw hw를 배포할것인가 설명
유지보수 계획 유지보수 요구사항 비용노력 예측
품질 계획 사용될 품질 절차 및 표준 설명
검증 계획 시스템 검증을 위한 방식 설명
검증계획 유지보수 계획 배치 계획 품질 계획 형상관리 계획

프로젝트 계획들의 부가적인 항목들

형상 계획 이란
형상 관리 - 소프트웨어와 관련된 변경사항을 체계적으로 관리
형상 : 코드 문서 파일등 변경가능한 항목

형상관리 계획
배치 계획
유지보수 계획
\품질 계획
검증 계획


프로젝 트 스케줄링
프로젝트 스케줄링 활동

활동 파악 - 활동 의존성 파악 - 활동 자원 측정 - 시간 할당 - 프로젝트 차트 생성
활동 계획 - 종속성 이없어야 하고 인력을 최적으로 사용하기위해 동시에 작업을 구성

활동 파악 - 활동 의존성 파악 -활동 측정 - 활동 할당 - 프로젝트 차트생성

일정 문제
문제의 난이도와 비용추청이 어렵다.
사람의 수와 생산성이비례하지 않는다.
오버헤드로 지연될 수 있다.

일정 표현

wbs gantt cpm 네트워크이런걸 통해 스케줄링 작업을 표현한다.

프로젝트 활동 소요기간 마감일 노력 추정 명확한 종료지점 이런스케줄링 이 필요

일정 그래픽 표기법 작업별로 분류한 내용 1~2주간격
캘린더 기반
활동 네트워크 : 종속성 표시

프로젝트 활동
소요기간
노력추정
마감일
명확한 종료지점

스케줄링에서 이정표 와 산출물

이정표 - 진행상황을 평가할수 있는 포인트
산출물 - 고객에게 전달되어지는 작업 산출물
이정표 산출물 이정표 마일 스톤

어느정도 이정표에 도달하면 진행상황을 평가할수 있다.
마일스톤 산출물

wbs cpm gantt chart
wbs 스케줄링에서 프로젝트를 더 작은 요소로 나누어 결과물 중심 분류
cpm 일련의 프로젝트 활동을 스케줄링 하기 위해 알고리즘
gantt 막대 차트 형식의 일정을 나타냄

wbs cpm gantt


애자일 플래닝

소프트웨어가 점진적으로 개발되어서 반복적으로 고객에게 제공됨

플랜드리븐과 다르게 증분기능을 미리 계획하지 않는다. 개발중 결정

고객의 요구사항이 변경됨으로 변경된 요구사항에 대해 유연하게 계획 필요

애자일 플래닝 스테이지
1. 릴리즈 계획수림 수개월 앞을 내다보고 릴리즈에 포함되어야할 기능 결정
2. 이터레이티브 계획수립 2~4 주간 반복적인 증분 계획에 중점

애자일 릴리즈 플래닝 이터레플래닝 2가지의 스테이지가 있음

스크럼 프로젝트 백로그 문제점 검토 플래닝 게임 스토리 기반으로 프로젝트 상황작성ㅇ

애자일 플래닝 릴리즈 플래닝 이터래이티브 플래닝
스크럼 플래닝 게임스토리 기반 진행상황 측정 애잘일 플랜 기반 특성

스토리 베이스 플래닝
스토리 기반으로 시스템에 포함되어야 할 기능 설명
각 스토리는 크기와 구현 난이도가 반영되는 effect point 속도측정의 기준
스토리 베이스 플레닝  - 애자일 - 릴리즈 플래닝 이터래이티브 플레닝 스토리 베이스 플레닝
스토리 베이스 플래닝에서 effectpoint 하루 작업의 속도
소요시간에 따라 우선순위 결정

스토리 베이스 플래닝의 개요

스토리 환인 - initianl estimate - rerleas planign - iterative planing - tastk planign

애자일 플래닝 특징 - 스토리 베이스 특징

스토리 확인 첫번째 추정 릴리지 플래닝 이터레이티브 플레닝 테스크 플레닝

릴리즈 계획은 시스템 기능을 반영할 스토리를 선택 및 스토리 구현 순서 과정 포함
반복 계획은 반복에서 구현할 스토리 선택 및 필요시간 반영



task allocation 개발자는 스토리를 개발작업으로 세분화
스토리를 개발 작업 세분화 개발 작업 4~16시간 소요
개별 개발자는 자신이 구현할 특정 작업에 등록

소프트웨어 딜리버리

sw증분이 끝날때 제공
기능이 어용된 시간에 작업을 못했다? 일전 변경은 없다.

애자일 플레닝의 문제
고객 참여 의돈 고객대표가 다른 우선순위 지정 어려울 수 있음
일부 고객은 플랜 드리븐 프로젝트에 익숙 애자일 참여 어려움

소규모 시스템 및 개발환경에서 매우 좋다 구조적 대규모일 수록 비효율적 적용 어려움

애자일
릴리즈 플래닝 이터래이티브 플레닝 테스크 플레닝

스토리 베이스 플래닝 을 진행

estimate techniues
비용추정 2가지 경험적 베이스 추정
알고리즘 코스트 모델링
1. experience based techniques
2. algoritm cost modeling

1. experent based techniques
관리자의 경험 및 과거프로젝트 기반

문제점 새프로젝트가 기존 프로젝트와 비슷하지 않거나 새로운 기술을 쓴다면
경험에 의존한 비용산정이 어렵다.
2. algoritm cost modeling
수학적 함수로 cost estimante

a size b m effort

a조직 의 스케일 이런거 b노력에 대한 불균형 m은 사람 속성 및 프로세스의 특성을 반영

size = 코드크기 effect = a * size b * m

estimante accuract
sw시스템의 크기가 커질때만 자세히 알수 있따.
비용추정에서는 사이즈가 커질수록 정확하게 비용추정이 가능해진다.

재사용된 구성요소 언어 및 분포가 크기의 영향을 준다.

개발이 진행될 수록 더 정확해지겠죠?

알고리즘의 단점
복잡하고 사용하기 어렵다.
많은 속성과 불확실성이 있는 상당한 범위가 존재


experence based techenuieqs
algoritm cost modeling

비용산정에서 하나 더 있다.
cocomo 모델 - 비용산정할때 사용함

코코모 모델 비용산정

소프트웨어 개발에 필요한 비용과 노력을 정량적으로 예측하는 비용예측 모델링중 하나
상세 정도와 하위 모델을 사용해서 추정치 생성
코코모 모델의 4가지 모델링
application composition model - 프로그램이 기존요소를 재활용할때 적용
early design model - 설계시작전 초기단계에 진행

reuse model = 재사용한 요소 통합할때 사용
post architecture model 아키텍쳐 설계되고 시스템에 대한 추가정보를 사용하면 사용
포스트 아키텍쳐 리유즈 모델 얼리 디자인 모델 어플리 케이션 컴포지션 모델

4가지 코코모에는

requirement engineering

요구사항 공학

요구사항을 어떻게 하면 잘 정립할까?

서비스를 정립하는 과정에서
시스템 요구사항은 시스템 서비스에 대한 설명과 공학프로세스에서 제약되어지는 조건을 포함한다.

요구사항 사용자 요구사항 시스템 요구사항으로 나누어진다.

계약입찰시 모호하게 만들어 업체들이 입찰
계약 자체에서 구체적이고 명확하게 요구사항이 정의

요구사항 1. 사용자 요구사항 2. 시스템 요구사항

이해당사자 시스템의 영향을 받고있는 개인이나 조직

애자일에서 요구사항
애자일에서의 요구사항 도출은 낭비이다.
주로 스토리로 표현 비즈니스 개발에는 효율적이지만 여러팀 개발 및 사전 분석이 필요한 시스템에서는 부적합

요구사항 기능적 비기능적 요구사항
기능적 요구사항 시스템이 제공해야 하는 서비스에 대한 설명
기능이나 서비스 설명
비기능적 요구사항
시스템이 제공하는 기능에 대한 제약
기능적 비기능적 제약상황
비기능적 요구사항이 기능적 요구사항 보다 중요할 수 있따.
시스템 쓸모가 없어질 수 있으니까

요구사항의 분류 - 제품요구사항, 조직 요구사항, 외부 요구사항

모표 : 사용자 편의성등 사용자의 일반적인 의도
검증 가능한 비기는적 요구사항 객관적 테스트가 간으한 몇 가지 척도 이용
검증위한 지표 속도 크기 편의성 신뢰성





configuration managemant 형상관리
변경사항을 추적하고 통제하는것을 형상관리라고한다.
보다 쉽게 버전이라는것을 붙여서 변경사항에 대해 추적 및 체계적으로 관리
유지보수상 향상
가시성이 없기 떄문에 진행정도를 형상관리를 확인하는 도구로 사용
변경사항을 체계적으로 관리
유지보수성을 향상시킨다
가시성이 없기때문에 진행정도를 확인하는 도구로 사용
유지보수성 향상 코드에는 가시성이 없기 떄문에 진행정도를 확인하는 도구로 사용할수 있다.
유지 보수성 향상
문제 발생시 문서나 코드를 체계적으로 관리함으로써 문제발생시 빠르게


형상관리(configuration)

소프트웨어는 개발중 지속적으로 변화함
구성관리 및 형상관리
변경되는 소프트웨어를 버전에 따라 체계적으로 변경사항 관리 및 버전관리

코드는 가시성이 없기 떄문에 변경사항 확인이 쉽지 않다 그러므로
형상관리를 통해 코드 관리 및 버전관리를 체계적으로 한다.

형상관리 활동

version management 버전 관리 다중버전으로 두어서 변경사항 확인가능
system building 실행가능한 시스템으로 컴파일
change management 변경사항을 추적 할 수 있다.
release management 외부 배포 준비 및 배포된 시스템에 시스템 버전 추적

애자일에서는 형상관리가 필수적이다

반복적으로 배포 및 증분을 하기 때문에 다양한 변경사항 및 증분에 대해서
변경을하며 쳬계적으로 관리한다.

형상관리의 어려운점
시스템 버전이 내부 테스트용으로 배포
개발 측면에서는 소프트웨어 구성관리 및 새기능 담당
시스템 테스팅에서는 내부 테스트용 배포

대형시스템에서는 다양한 버전으로 multiversion system을 운영하기도 한다.
다양한 버전에 여러 개발팀이 운영할수 있다.

cm의 단어
베이스 라인 시스템을 구성하는 컴포넌트 버전모음
코드라인 컴포넌트와 종속 항목의 버전 세트
브랜치 기존 코드에서 새로운 코드사항 발견
형상관리
메인라인 시스템의 다양한 버전을 나타내는 베이스라인
합병 합병 릴리즈 배포 저장소 버전 메타정보를 저장하는 데이터 베이스
베이스


소프트웨어의 진화
소프트웨어 변경은 필연적이다
사용중 요구사항이 발생하거나 오류수정등 다양한 요인이 발생함으로 소프트웨어 구현하고
관리를 위해서는 소프트웨어 진화가 필수적

소프트웨어 핵심 비즈니스 자산
소프트웨어를 유지하기위해서는 지속적인 변경과 업데이트 필요 이게 바로 진화
대기업의 예산은 유지보수 개발 보다 유지보수 진화의 코스트가 더많이 소요된다.


진화와 서비싱 (evolution servicing phase out)
1. evolution : 운영중이며 새로운 요구사항을 반영하여 진화하는단계
2. servicing : 더이상 진화는 하지 않지만 운영유지만 하는 단계 기능 변화가 없다.
3. phase-out retirement : 소프트웨어는 여전히 사용할 수 있으나 더 이상 변경이 없다.


소프트웨어 진화의 중요한 법 : lehmans law
1. 프로그램의 유용성을 유지하려면 지속적으로 변화해야한다.
2. 변화하는 프로그램의 구조는 점점더 열화되어져간다.
3. 프로그램의 수명동안 변화율은 자원과 무관하게 일정하다.
4.각 릴리즈의 증분변화는 대체적으로 일정
5. 사용자 만족도를 위해서 새롭게 기능추가되어야한다.
6. 변화율은 자원과 무관하게 일정 만족도를 위해서 새로운기능 증분변화는 대체적으로 일정

소프트웨어 진화 프로세스

진화 프로세스는 변경제안으로 부터 시작
변경 요청 - 충격 검증 - 릴리즈 플래닝 - 실제 구형 변경 구현 - 시스템 릴리즈
change request - impact analys - release planing - change implement- system release

change idenfication process change proposals software evolution process


change implementation 변경사항 구현
시스템 수정사항을 설계 구현 및 테스트 개발 프로세스를 반복한다.

변경구현에는 시스템에 대한 이해도가 있어야한다.


proposeed change requirment analys requirement update software develope - change implemnetation

urgent change request 긴급 변경은 모든단계를 거치지 않고 구현될수 있다.

urgent change request
change request - analyze sourcecode - modifiying sorce code - dielver modified system
이렇게 긴급 변경은 모든단계를 거치지 않는다.

애자일 과 진화
애자일은 점진적으로 개발하기 때문에 개발에서 진화로 원할하게 변환
애자일 - 점진적이기 때문데 진화로 원할하게 변환
변경사항은 추가 사용자 스토리로 표현가능

핸드오버 문데
애자일 -애자일에 익숙하지 않음
플랜드리븐 - 사람들이 플랜드리븐 선호하지 않음즉

이렇게 서로 반대대는 양상으로 인해서 리팩토링되어지지 않을 수 있다.

소픝트웨어 유지보수
소프트웨어가 사용된 후 프로그램 수정
주로 커스텀 소프트웨어 변경에 사용됨 범용 소프트웨어는 새로운 버전으로 진화 하기때문

유지보수  - 커스텀 소프트웨어에서 주로 사용
범용 - 버전진화

유지보수의 타입
1. 결함 수리 2. 환경적 적응 3. 기능 추가 및 수정 4. 새로운 요구사항추가
결함수리 환경적응 새로운 요구사항 추가 기능 수정

maintenance cost - 개발 비용보다 더 비싸다.

유지보수 비용은 개발 비용보다 더 크다.

기술적 요인과 비기술적 요인 모두 영향
유지보수가 진행되어질수록 비용은 증가
구조 손상으로 인해 유지 보수가 어렵기 때문
노후화된 프로그램은 높은 유지보수 비용발견

유지보수 예측
시스템에서 문제를 일으키거나 유지보수를 해야할 포인트를 평가
변경 수용성은 컴포넌트의 유지보수성에 의존
변경 구현은 시스템을 열화시키고 유지보수성을 감소
유지보수성 비용은 변경횟수와 비용에 따라 결정되어진다.

change prediction 변경 예측
변경에측은 시스템과 환경 관계의 이해가 필요하다.
시스템 인터페이스에서 복잡성
시스템 요구사항
비즈니스 프로세스에 따라 change prediction이 변경된다.

complexity metrics  유지보수 가능성 예측
컴포넌트 복잡성으로 평가
복잡성 제어구조 데이터 구조 모듈크기에 따라 유지보수가 복잡해진다.

process metrics
유지관리 가능성을 평가하는데 사용되어진다.
수정 유지 요청수 영향분석에 필요한 시간등 다양한 요소에서 증가하면 process mestrix에서
유지관리 가능성이 저하된다.


software reengineering 소프트웨어 리엔지리어링
소프트웨어 리엔지니어링(재공학) 은 기능을 변경하지 않고 레거시 시스템 일부 또는 전체를 재구성하거나 재작성
일부 하위 시스템은 빈번한 유지 관리가 필요한 경우 적용
재공학 시스템은 더 쉽게 유지 관리 할 수 있도록 노력
시스템 재구성 및 재 문서화가 될 수있음
시스템 재구성 재문서화 가능
레거시 시스템을 재작성 일부 또는 전체를

개발 비용보다 적게들고 실제 개발하는것보다 문제 발생가능성을 낮춘다.
문제 발생가능성 낮추고 비용도 적게 든다.

리팩토링
개발 및 진화과정에서 지속적인 개선을 하는과정
구조 및 코드의 열화 방지 유지보수성 증가 및 유지보수 비용 감소로 이어진다.

리팩토링에서 배드스멜
겹치는 코드 유사한코드가 여러개가있음
긴 메소드 매소드가 길면 짧은 메소드로 변경
데이터 군짐 동일한 데이터가 clumping군짐을 이루고 있으면 모든 데이터를 포함한 데이터로 대체
중복발생가능 switch statement 스위치 문이 곳곳에 흩어짐 다형성을 통해 해결가능

리팩토링 과정중하나

소프트웨어 테스팅
버그 오류 결함 고장
프로그램 테스팅
결함을 발견하기위해 테스팅을 통해 비기능적 속성을 확인 및 검증

테스트 목표 요구사항 충족 및 요구사항에 대해 하나이상 테스트에 있어야한다.

검증 테스팅 결함 테스팅
검증 테스팅 예상 용도를 반영하는 테스트케이스 셋을 사용함
결함 테스팅 일부러 결함에 노출하여 의도적으로 모호기능 결함 발견하게 테스팅한다.

vilidation 과 valification 은 다르다.

요구사항 분성 명세 코딩 릴리즈 요구사항 - 릴리즈 -> validation 분석명세(analys specification )-> 코딩 -> 확인 (valification)

확인 올바른 제품을 만들고 있는가?
검증 올바르게 요구사항을 충족하고 있는가?

v&v  confidence
시스템이 목적에 적합하다고 확신을 주는것
validation and valification confidence
시스템이 올ㅈ바르게 요구사항을 충족하고 올바른 제품이다.
soft purpose 신뢰 수준은 소프트웨어가 조직에 얼

유저 기대 : 사용자의 특정종류 sw에 대해 기대치가 낮을 수 있다.
마케팅 환경 : 초기 시장에 출시하는것이 결함을 찾는것 보다 중요할 수 있다.

테스팅 inpectation 과 testing
inspectation 은 코드 검토 도구 기반 문서 와 코드를 분석
testing 실제 시스템을 테스팅 및 검증 하는것

소스표현 검사 시스템 실행 사용가능
구현전 사용가능하도
테스트중 오류로 인해 가려지는 현상을 방지 상호작용을 걱정안해도 된다.
검사와 테스트는 반대는것이 아니다

v&v 과정에서 사용되어진다. 검사와 테스팅

검사에서는 실제 요구사항 준수되었는지 확인하지 않는다 성능과 같은 비기능적 요구사항도 확인하지 않는다.
요구사항 비기능적 요구사항은 검사에서 확인하지 않는다.

테스트 단계

개발 테스팅
릴리즈 테스팅
사용자 테스팅

개발 테스팅 유닛 테스팅 컴포넌트 테스팅 시스템 테스팅
릴리즈 테스팅 다른 개발팀이 요구사항 기반으로 테스팅
사용자 테스팅 알파테스트 베타테스트 acceptance testing이 있다.
개발 테스팅
유닛 테스팅 유닛 객체내 개별함수 및 여러속성이 있는 클레스를 테스팅
수동 개입 없이 테스트를 실행하고 점검하도록 한다.

setup callpart assertion part
이렇게 나누어 진다.

테스팅 전략 가이드라인 베이스 테스팅
파티션 테스팅 공통특성이 있으면 동일한 방식으로 동작 및 파티션 구간의 테스팅
가이드라인 베이스 테스팅 - 테스트 지침을 사용
입력버퍼를 유발하거나 유효하지 않는 출력 결과가 크겠금

시스템 테스팅 - 유즈케이스 기반 테스팅

테스트 정책 철저한 테스트 못하니까 테스트 정책 개발

tdd 테스트 기반 개발
테스트와 코드 개발을 중간에 반복적으로 수행하는 개발방식
장점 디버깅 수월 및 회귀테스트 가능

회귀적으로 테스팅 시스템 문서화 수월하다.

즌분에 대한 테스트와 이전 테스트를 모두 한다.


릴리즈 테스팅

개발팀 외부의 팀에서 특정 릴리즈 테스트
blackbos테스트 케이스
일번적인 시스템 사양에서 파생되는 블랙박스 테스팅을 한다.

시스템 테스트의 한 형태

개발을 참여하지 않은 팀이 릴리즈 테스트를 한다.
릴리즈의 목적은 시스템이 해당 요구사항을 만족하는지 확인
시스템 테스트는 버그를 찾는것에 포커스

릴리즈 테스트는 요구사항 기반 테스트

아키텍쳐 디자인

컴포넌트 명백한 역할을 가지며 독립적으로 존재 가능한 시스템의 부분
교체가능 모듈 언어 문법 구조에서 정의된 컴포넌트
서브시스템 여러 다른방법으로 구현될 개체

아키텍쳐 설계

시스템의 전체적인 구조로 설계하는 방법
설계와 요구사항 공학간 중요한 연결구리

애자일에서 프로세스 초기단계에서 아킽텍처 디자인을 한다.
시스템 아키텍쳐 리팩토링은 비용증가로 이어지기때문에
애자일에서 프로세스 초기단계ㅅ에서 시스템 아키텍쳐 디자인을 한다.


box&line diagram 매우 추상적인 아키텍쳐 표현 방법

2. 아키텍쳐 디자인 결정

아키텍쳐 재사용
동일한 도메인 시스템을 가지고 있는경우가 대다수 이기 때문에
본질을 포착해 인스턴스화 가능

아키텍쳐 및 시스템의 특성

성능 보안 안전 유효성 유지보수성

3. 아키텍쳐 뷰

아키텍쳐모델을 해당 아키텍쳐에대한 뷰 및 관점만을 표시한것
시스템이 모듈로 분해 상호작용 문서화 에대해 아키텍쳐에대해 다양한 관점 제시

아키텍쳐뷰
1. 로지컬 뷰
2. 프로세싱 뷰
3. 피지컬 뷰
4. 디벨롭 뷰

로지컬 뷰 시스템의 주요 객체 및 클래스
프로세스 뷰 : 런타임에서 상호작용하는 프로세스는 어떻게 구성되어지는지
디벨롭 뷰 : 개발을 위해 sw가 어떻게 분해하는지
피지컬 뷰 : 시스템 hw 와 sw 가 분상되어지는 방식

아키텍쳐 설계 3가지 포인트
module view component view workassignment view 데이터 저장소 및 업무 할당

4. 아키텍쳐 패턴
1. MVC 패턴 (모델 컨트롤러 뷰)
모델 구성요서 시스템 데이터와 데이터에 대한 작업
컨트롤러 뷰와 모델간 상호작용 관리
뷰 데이터가 사용자에게 표시되어지는것 정의

장접 데이터가 표현 방식에서 독립적으로 변경가능 동일한 데이터 여러번 표현 변경사항 한번에 반영
단점 데이터 모델과 상호작용시 추가적인 코드와 코드 복잡성 발경
장점 요구사항 변경시 한번에 반영 동일한 데이터가 여러방식으로 표현

layerd architectual pattern
독립적인 계층들이 일련적으로 계층구성
시스템을 각 계층과 관련이 있는 계층으로 구성
기존시스템을 개발할때 보안이 요구되어지는데
다단계로 이루어져 신뢰도아 향상 및
전체 레이어를 교체 가능하다.

리포지토리 아키텍쳐

5. 어플리 케이션 아케텍쳐
특정 요구를 충족하도록 설계
기업은 공통점이 많아서 애플리케이션 시스테은

system version
change management
release managemnet
vsersion management



클라이언트 서버 아키텍처 서버 기능을 제공 서비스를 요청하는 클라이언트로 구성되어짐

여러장소에서 서비스를 공유할때
부하에 따라 서버를 늘릴수 있음

서버 기능을 분산배치 가능 클라이언트는 서버의 기능 서비스를 활용 중복 구현이 필요 하지 안다.
서버 다운시 서비스 이요불가
웹브라우저 및 이메일 시스템 서버 클라이언트

데이터를 순차적으로 처리할ㅇ때 각필터로 처리하고 통로를 통해 데이터를 흐를는 구조 각 필터는 입력 데이터가 가공후 다음 필터로 전다.ㄹ
데이터를 여러 단계에 걸쳐서 변환할때
각단계가 독립적으로 교체나 개선이 가능하도록 만들때

각필터가 독립적이어서 재사용 확장 쉬움

파이프에 따라 단계를 추가 삭제 가능
필터가 많아지만 성능이 저하된다.

어플리케이션 아키텍쳐

특정 조직의 요구를 충족 공통점이 많은 어플리케이션은 공통 아키텍쳐를 갖는 영향

아키텍쳐 설계의 시작점 설계 체크리스트 작업 구성방법 재사용 구성요수 평가수단.

아키텍쳐 유형

데이터 프로세싱 앱
트랜젝션 프로세싱 앱
이벤트 프로세싱 앱
랭기지 프로세싱 시스템

트랜젝션 프로세싱앱 전자 상거래 시스템 예약 시스템 tsp

tps information sysmtem

트랜잭션 하나의 논리적 작업의 단위로 모두 성공 또는 모두 실패해야한다. 원자성

원라인 쇼핑몰 결재 재고 감소 및 결재 처리 예약 시스템

정보 시스템 아키텍쳐 information system architecture
사용자 인터페이스 사용자와의 통신 입출력 정보 검색 db관리등 다양한 계층 구조로나눔

대부분 트랜잭션 기반
웹기반 정보 시스템

정보 시스템 아키텍쳐

자연어 또는 인공언어를 입력받아 변환하는 시스템
language processing system

언어 처리 시스템

컴파일러 번역기 sql등 다양한 시스템이 사용된다.

소프트웨어 테스팅과 검사

inspections
testing review

v&v 검증 및 확인을 위한 신뢰 형성
테스팅의 주요 요소

내가 개발한 소프트웨어가 요구사항에 부합하는지 그리고 올바른 제품을 만들었는지 평가하는 활동
신뢰수준에 영향을 주는 요소 소프트웨어 목적 사용자 기대치
마케팅 환경
소프트웨어의 목적
유저기대치 사용자들은 소프트웨어에 따라 기대치가 다름
마케팅 환경 때로는 빠를게 제품을 출시하는것이 결함을 잡아내는것 보다 더 중요할 수 있다.

테스트 개발 테스트 릴리즈 테스트 사용자테스트

개발 테스트 유닛 테스트 컴포넌트 테스트
시스템 테스트

unit테스팅 개별 유닛 및 클래스 테스트
컴포넌트 테스팅 복합구성요소를 생성하기 위해 유닛 통합시 인터페이스 테스트 위지
시스템 일부 모든 구성요소 테스트 구성요소 상호작용 중점


유닛 테스트
개별 구성 요소를

setup part
call part
assertion part

cause effect logic flow 그래프 다이어그램이 guideline base 테스팅







*/